Revit 2026 API
ElementMulticategoryFilter Constructor
Overload List
Name | Description
ElementMulticategoryFilter(ICollection<BuiltInCategory>) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<ElementId>) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<BuiltInCategory>, Boolean) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<ElementId>, Boolean) | Initializes a new instance of the ElementMulticategoryFilter class
Top
See Also
Reference
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace